InformationRegisters/СлужбыДоставкиИнтернетМагазина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СлужбыДоставкиИнтернетМагазина</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеСлужбыДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСлужбыДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СлужбыДоставкиИнтернетМагазина/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Функция ПредставлениеСтрокой(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СлужбыДоставкиИнтернетМагазина.НаименованиеСлужбыДоставки КАК НаименованиеСлужбыДоставки
	|ИЗ
	|	РегистрСведений.СлужбыДоставкиИнтернетМагазина КАК СлужбыДоставкиИнтернетМагазина
	|ГДЕ
	|	СлужбыДоставкиИнтернетМагазина.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат СтрСоединить(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НаименованиеСлужбыДоставки"), ", ");
	КонецЕсли;
	
КонецФункции

Функция ТаблицаСоответствияСлужбДоставки(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СлужбыДоставкиИнтернетМагазина.ИдентификаторСлужбыДоставки КАК ИдентификаторСлужбыДоставки,
	|	СлужбыДоставкиИнтернетМагазина.СпособДоставки КАК СпособДоставки,
	|	СлужбыДоставкиИнтернетМагазина.НаименованиеСлужбыДоставки КАК НаименованиеСлужбыДоставки
	|ИЗ
	|	РегистрСведений.СлужбыДоставкиИнтернетМагазина КАК СлужбыДоставкиИнтернетМагазина
	|ГДЕ
	|	СлужбыДоставкиИнтернетМагазина.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
